import React, { Component } from 'react';
import {
  Text, StyleSheet, View, Image, ScrollView,
  ImageBackground, TouchableOpacity, TouchableHighlight, Modal, ActivityIndicator, StatusBar, TextInput, TouchableOpacityBase,
} from 'react-native';
import Icon from 'react-native-vector-icons/FontAwesome5';
import { Dimensions } from 'react-native';
const windowWidth = Dimensions.get('window').width;
const windowHeight = Dimensions.get('window').height;


import Screen1 from './Tasks/Screen1'
import Screen2 from './Tasks/Screen2'


import { createAppContainer } from 'react-navigation'
import { createStackNavigator } from 'react-navigation-stack'
// import {
//   createDrawerNavigator,
// } from 'react-navigation';


class App extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
      isVisible: true,
      tirmnate: true,
      Categoris: [
        {
          name: 'من انا ؟',
          photo: require('./img/m4.jpg'),
          Items: [
            {
              text: ' الرحالة محمد المصرى يحلم ان يكون طائر يحلق حيثما يشاء واينما اراد جعل من مدن مصر وجهته الاولى فى تحقيق حلمه ورغم ان التاريخ يحتفل بالرحالة ويشكرهم على جهدهم الا ان المجتمع واجهه بالسخرية ومرة احرى بتكسير الارادة ولكنه اصر واكمل حتى تسلق ليحلم بدراجته ',
              img: require('./img/mohamed.jpg'),
            },
            {
              text: 'محمد ابو عجيزةوشهرته(محمد المصرى) صاحب ال 27عاما وقع فى غرام السفر ولكنه غرام من نوع اخر وجده فى دراجتهى التى تشبهه فاحلامه قوية مثل حديدها  وروحه خفيفة تحلق بين بلدة واخرى بينما ارادته مثل صلابة دراجته التى تتفوق على كل الطرق المؤلمة  التى تمر فوقها ',
              img: '',
            },
            {
              text: 'فى احد دهاليز محافظة الغربية وفى قلب دلتا النيل تشكل شريان حياة ابن مركز بسيون محمد ابوعجيزة وشهرته محمد المصرى وتعلم مهنة النجارة وتزوج فكان له من الاولاد سلمان وعبيده',
              img: '',
            },
            {
              text: ' ولديه ورشة موبيليا وبها 12عامل وبفضل من الله انا مؤسس الورشه والمعرض  وهوايتى ركوب الدرجات وهذا ما يعرفة القليل او الكثير منكم حتى الان ممكن يكون الحب لاى شئ فى العالم وانا اقتصرته لدرجتى لانها تقودنى للجنون والشغف والحلم والتحدى والترحال وعمل الخير ',
              img: require('./img/bb16.jpg'),
            },
            {
              text: 'دراجتى تتكون منى حرفيا كل مكوناته تعبر عن شخصيتى فانا خفيف مثلها وانا اترحل وصلب عندما امر باشد الطرق المؤلمه لدى خطة محتمه لكى نمتزج سويا فانا اصبح هى وهى تصبح انا اشعر انها فريدة من نوعها فانها تمشى على الارض ولكنها تصل سعادتى للسماء فهيا يد المساعدة لى لفعل كل ما احبه فهيا دراجتى التى جعلتنى. حبيت اشاركم تجربة نجاحى',
              img: '',
            },
            {
              text: 'تعرضت  للنقد الشديد والسب وانى شخص لا افعل اى شى مفيد تعرضت لصدمة مع نفسى وانى قد فكرت حقا بالتخلى عن حلمى ولكن ارادتى وعزيمتى فى النجاح هى التى قادتنى لفعل قصة نجاح جديدة وتحدى اقوى من قبل فانا اؤمن أن الذين لديهم الجرأة على مواجهة الفشل ، هم الذين يقهرون الصعاب وينجحون وانا لم افشل بعد اقاوم افكار الفاشلين',
              img: '',
            },

            {
              text: 'لاوصل فكرتى وهدفى عبر دراجتى فأن الناس سينسون السرعة التي أنجزت بها هدفى ، ولكنهم سيتذكرون نوعية ما أنجزته فانا اؤمن بأن النجاح ليس كل شيء ، إنما الرغبة في النجاح هو كل شيء فانا اروج للسياحة فى بلدى مصر وآرها كما يجب ان يراها العالم',
              img: '',
            },
            {
              text: 'فى رحلاتى فى محافظات مصر لم اتعرف على ثقافات عديدة فقط بل اتعرف على اشخاص حقا يؤمنون بالنجاح والفكر والاختلاف والتميز فأن إذا لم يجد الإنسان شيئاً في الحياة يموت من أجله ، فإنه أغلب الظن لن يجد شيئاً يعيش من أجله. فانا اعيش لاجل هدفى وحلمى',
              img: '',
            },
            {
              text: 'انا بفضل الله قائد  تيم  وفريق هنشوف بلدنا على العجل\nاول فريق موثق في الاتحادالمصري والدولي للدراجات الهوائية',
              img: require('./img/v7.jpg'),
            },
            {
              text: 'اخر مشاركه ليه كانت مع وزيرة الخارجية ووزيرة البيئة بالإسكندرية تما تكريمي من منظمه حقوق الانسان الدوليه ووزير الشباب والرياضه ووزيرالسياحه وهناك أشياء كثيرة لا ا اذكرها واخيرآبالف كتاب بحكي فيه عن جميع رحلتي  وابراز المصاعب الي مريت بيها  وبرغم من ان معظم الي  بينتقدو .. محدش منهم حاسس ولا عارف قيمة ولا متعة الهواية دى ولا فوائدها',
              img: '',
            },
            {
              text: 'طبعا هوايتك يعنى انت ولو دفنتها عمرك مهتلاقى نفسك فى شى تانى اصل السعادة هي ليست غياب المشاكل، وإنما القدرة على التعامل مع هذه المشكلات حل مشكله الوقت وحاول تجد وقت لنفسك لتمارس هوايتك الخاصة.',
              img: '',
            },
            {
              text: 'إن ربط الهواية التي يرغب الشخص بممارستها وكسبه للمال سيؤدي إلى ابتعاده عن أي من الهوايات التي يفضلها والتي لا تدر عليه أي مردود مادي جيد، لذا انصح بالتركيز على الهواية التي تعجبه مهما كان نوعها وابقاء المال والأمور المادية خارج هذه المعادلة، إذ أن العاطفة القوية التي يمتلكها الشخص تجاه الهواية التي يحب ممارستها ستساعده في الوصول إلى الرفاه النفسي',
              img: '',
            },
            {
              text: 'انا شخص لست لدى الرفاهية الكامله التى يظنها البعض انا فقد اؤمن بهوايتى وبنفسى ابتعد عن نفاق الآخرين لى، فأنا لست رائعًا بهذه الصورة التي يمدحوننى إياها وقتما اسافر، ولست سيِّئًا فظيعًا كما يخبروننى وقتما اصل لهدفى. المهم، هو ما تعلَّمته أنا في كلا الوقتين، وكيف ساتعامل مع الأمرين في المستقبل',
              img: '',
            },

            {
              text: 'انا بفضل الله رئيس لجنة دعم السياحة والاثار فرع منظمة الاتحاد المصرى لحقوق الانسان (الايرو) وهذا شرف كبير لى ',
              img: require('./img/bb13.jpg'),
            },
            {
              text: 'الحمد لله تم قبولى للمشاركة فى منتدى الشباب العالمى ويتم تنظيم المنتدى من قبل ادارة الشئون الاقتصادية بالامم المتحدة (UNDESA) بالتعاون مع مكتب مبعوث الامين العام للشباب (OSGEY) والمجموعة الرئيسية للاطفال والشباب (MGCY) والاجتماع التنسيقى الدولى لمنظمات الشباب (ICMYO) وكذلك شركاء فى منظمة الامم المتحدة ',
              img: require('./img/v9.jpg'),
            },



          ],

        },

        {
          name: 'نصائح السفر بالدراجة',
          photo: require('./img/gg3.jpg'),
          Items: [
            {
              text: 'فوائد ركوب الدراجة : \n1- يعمل على تحسين صحة القلب، ويعزز من صحة الأوعية الدموية، كما أن ركوب الدراجات الهوائية يزيد من درجة حرارة الجسم، وبالتالي له دور كبير في التحسين من مستوى لياقة الجسم.\n2- مفيد للحفاظ على قوة العظام، كما تعمل على خفض مستويات الدهون بالجسم.',
              img: require('./img/mo3.jpg'),
            },
            {
              text: 'يساعد على زيادة مرونة عضلات الجسم، كما يساعد ركوب الدراجات الهوائية على الخفض من نسبة التوتر، والحد من الشعور بالاكتئاب، كما أنها رياضة مميزة للتحسين من تنسيق قوام الجسم.\n3- لها القدرة على الوقاية من الإصابة بالأمراض المختلفة، كما تساعد على حرق نسبة كبيرة من السعرات الحرارية، وتزيد من معدل ضربات القلب.',
              img: '',
            },
            {
              text: '3- القدرة على التحمل : ركوب الدراجة لأميال قليلة كل يوم بشكل منتظم.وسيلة رائعة لبناء قوة جسدية. ومن أسهل الرياضات التى تمكنك من ذلك بسهولة.\n4- لياقة الجهاز الدورى : ركوب الدراجة وسيلة رائعة لتوفير التمرين الذى يحتاجه قلبك. الركوب المستمر يجعل قلبك يضخ الدم بشكل أسرع وبمعدل ثابت.و هذا أمر جيد لتقوية عضلة القلب',
              img: '',
            },
            {
              text: '5- إنقاص الوزن : طريقة عظيمة لحرق السعرات الحرارية هى ركوب الدراجة بأسرع وقت و بشكل منتظم. و بالأخص التخلص من زيادة محيط الخصر و الدهون الزائدة. شخص يزن حوالى 75 كيلو جرام  يستطيع حرق أكثر من 600 سعر خلال ساعة من ركوب الدراجة. كلما زادت دورات ركوبك تستطيع حرق أكثر و أكثر.',
              img: '',
            },

            {
              text: 'اليك مجموعة من أهم نصائح السفر بالدراجة الهوائية : \n1. قم بالتخطيط جيدا لرحلتك سفرك بالدراجة الهوائية وذلك بدراسة خط سيرك جيدا والحصول على خريطة واضحة للمناطق التي استمر بها في رحلة سفرك بالدراجة الهوائيةوعليك أيضا التأكد من معرفة مناطق الاستراحة والفنادق والمطاعم في المناطق التي ستمر عليها ، لكي تتمكن من التوقف والحصول على استراحة للنوم أو لتناول الطعام عند الحاجة . ',
              img: require('./img/mo1.jpg'),
            },
            {
              text: '2. لا تبحث عن الدراجات الأنيقة وقطع الاكسسوار الباهظة في الدراجة الهوائية التي ستستخدمها في السفر ، بل ابحث عن العملية والمتانة ، فالدراجات الهوائية الأنيقة أو تلك المصممة من قبل ماركات شهيرة ، فقد لا تتوفر قطع الغيار الخاصة بالدراجات المصممة في المناطق التي تتوقف فيها لصيانة دراجتك الهوائية خلال رحلة سفرك خاصة إذا كانت عبر مناطق ريفية .',
              img: '',
            },
            {
              text: '3. احرص على حمل قطع الغيار الأساسية الدراجات الهوائية تحسبا لوجود تلف أو عطل غير متوقع في دراجات الهوائية خلال رحلة السفر .\n4. ليس من الضروري شراء دراجة ذات إطار من الصلب للسفر بها ، فالدراجات المصنوعة من الألومنيوم ذو النوعية الجيدة تتمتع أيضا بمتانة جيدة كما أنها أقل تكلفة وأخف وزنا وقوية بما يكفي لتحمل رحلات السفر الطويلة . ',
              img: '',
            },
            {
              text: '5. تأكد من معرفة قواعد الصيانة الأساسية للدراجات الهوائية حتى تتمكن من إصلاح الأعطال البسيطة عند الحاجة لذلك . \n6. تأكد من وضع اسمك وطريقة الاتصال بك على بطاقة مثبتة جيدا على دراجتك الهوائية التتمكن من استعادتها في حالة ضياعها . 7. تأكد من تفقد الطقس جيدا قبل أن تبدأ رحلتك بالدراجة الهوائية لترتدي الثياب الملائمة',
              img: '',
            },
            {
              text: '8. ركوب الدراجة من الرياضات التي تحتاج إلى قدر كبير من الطاقة لذلك احرص على أن تحمل معك بعض الوجبات الخفيفة التي تمدك بالطاقة والسعرات الحرارية اللازمة لتتمكن من متابعة رحلتك بالدراجة حتى الوصول إلى مناطق الاستراحة التي قمت بتحديدها مسبقا ، ويمكنك تجنب الإصابة بالجفاف بتناول الماء والعصائر كل 15 دقيقة خلال رحلتك بالدراجة الهوائية . ',
              img: '',
            },
            {
              text: '9. احرص على أن تحمل معك هاتفك الذكي المزود بخاصية GPS وخدمة إنترنت لتتمكن من تحديد موقعك بدقة إذا ما فقدت الطريق وطلب المساعدة أو  الاتصال بخدمة إنقاذ عند الحاجة لذالك .',
              img: '',
            },
            {
              text: 'التجهيزات التى تحتاجها خلال رحلتك بالدراجة: \n1- خيمة يمكن شرائها من أى محل أدوات رياضية.\n2- منامة sleeping bag لأن الجو ليلاً يكون بارد سواء على الطريق الزراعى أو الصحراوى.3- كشاف قوى + كشاف أمامى للدراجة + كشاف خلفى (سيفيدك إذا اضطررت للتحرك ليلاً حتى تراك السيارات).',
              img: require('./img/mo2.jpg'),
            },
            {
              text: '4- عدة إصلاح الدراجة وهى متوافرة عند أى محل للدراجات. \n5- إطار داخلى احتياطى وعدة لحام سريع.\n6- منفاخ وهو متوافر عند أى محل للدراجات.\n7- حمالة خلفية للدراجة تتحمل على الأقل 10 كيلو.',
              img: '',
            },
            {
              text: 'احتياجات الطعام والشراب:\n* احمل ما خف وزنه وزادت قيمته مثل البلح وعسل النحل، ممكن تشترى عسل وتضعه فى "زمزمية"، وهناك أنواع من العسل تكون معبأة فى زجاجات تشبه "الزمزمية" جاهزة، العسل مهم جدًا فهو يمنح المسافر طاقة كبيرة.',
              img: '',
            },
            {
              text: '* لو الطريق صحراوى يجب أن تأخذ الكثير من المياه والعصائر وكلما مررت بمكان يجب أن تشترى منهم قدر الإمكان، لكن لو كان السفر على الطريق الزراعى لا داعى للقلق طوال الطريق ستجد طعام وشراب.\n* السفر على الصحراوى أيضًا يتطلب معدات لإشعال النار لعمل الأكل أو المشروبات الساخنة.',
              img: '',
            },
            {
              text: 'الملابس والتجهيزات الشخصية: \nالاستعددات ستختلف حسب ظروف الجو وتوقيت السفر، لكن بشكل عام حتى لو كانت الرحلة فى الصيف يجب أن ترتدى "تى شيرت" بأكمام، وبنطلون طويل وقفاز، فى حالة السفر شتاءً ستحتاج لملابس أثقل ولكن لا ترتدى "جاكيت" لأنه مع الحركة ترتفع حرارة الجسم، أما عدد الملابس فيتحدد حسب فترة السفر ومن الممكن أن تغسل ملابسك فى كل مكان تبيت فيه، كى لا تحمل الكثير من الملابس، وستحتاج خوزة بالطبع.',
              img: '',
            },
            {
              text: 'الظروف الجوية :\nيجب أن تختار الوقت المناسب وتتابع دائمًا ظروف الطقس، خاصة إذا كنت ستسافر فى الصحراء يجب أن تكون ظروف الجو مناسبة ولا توجد عواصف أو احتمالات لهبوبها، لأنها تسبب مشكلة كبيرة جدًا للمسافر بالدراجة، ولكن الطريق الزراعى فلا توجد مشاكل كبيرة فى هذا الخصوص.',
              img: '',
            },
            {
              text: 'كيف تختار مكان المبيت؟  \nإذا كان السفر على الطريق الزراعى ستكون أمامك عدة حلول:\n* الإقامة فى أحد الفنادق الرخيصة التى تتوافر فى المحافظات، وتكلفة الليلة حوالى 100 جنيه.\n* المبيت فى إحدى المساجد على الطريق ',
              img: '',
            },
            {
              text: '* التخييم إلى جوار مسجد أو نقطة إسعاف أو شرطة\n* من الممكن أن تتلقى دعوة من شخص بالتخييم إلى جوار البيت أو المبيت عنده\nولكن كتجربة شخصية يفضل المبيت فى الفنادق، وفى الحالتين كل طرق مصر تقريبًا فيها استراحات',
              img: '',
            },
            {
              text: 'أما إذا كان السفر على الطريق الصحراوى فيمكنك المبيت فى:\n1- نقاط الإسعاف\n2- نقاط الشرطة أو الجيش أو الكمائن\n3- التخييم فى الصحراء وحدك \nصيانة ومتابعة الدراجة كل يوم يجب أن تتابع الدراجة وتفحص الإطارات وتملأها جيدًا وتربط الدراجة جيدًا وتربط الحقيبة كذلك.',
              img: '',
            },

          ]
        },



        {
          name: 'رحلاتى بالدراجة',
          photo: require('./img/m8.jpg'),
          Items: [
            {
              item_name: 'طنطا',
              item_img: require('./img/mh2.jpg'),
              Data: [
                {
                  text: 'طبعا كان لازم اول رحلة اطبقها للمباردة اللي حلمت انها تنجح و اللي سميتها (هنشوف بلدنا علي العجلة) هي بلدي و من محافظتي اللي بحبها الغربية علشان كده بدأت اول رحلاتي في حياتي بمدينة طنطا',
                  Data_img: require('./img/tt1.jpg'),
                },
                {
                  text: 'جهزت كل حاجة في شنطتي..ماية و اكل و قطع غيار للدراجة اللي اشتريتها مخصوص للرحلات بتاعتي و انطلقت في أولي رحلاتي كرحالة في حياتي. طبعا مش عاوز احكيلكم عن كمية السخرية اللي واجهتني و خصوصا و انا خارج من قريتي ( الشابية مركز بسيون محافظة الغربية ) كأني بعمل حاجة غلط او عيب انا عارف ان الحاجة دي مش تقليدية في بلدنا لكن في الاول و في الاخر انا قررت اعمل الحاجة اللي بحبها و بس',
                  Data_img: '',
                },
                {
                  text: 'بس بمجرد ما خرجت من البلد و طلعت علي الطريق بدأت أحس شوية حرية و فعلا بدأت ادخل عالم الترحال طبعا مكنش حد يعرفني لدرجة أن بقيت انا اللي اقف اسلم علي الناس و اعرفهم بنفسي البعض منهم لقيتهم مرحبين بيا لدرجة كبيرة و جزء منهم كان ردهم خلاني افكر ارجع بلدي من كمية الإحباط اللي واجهتها من كلام الناس لكن من خطوات النجاح عدم التركيز مع الاراء الهدامة',
                  Data_img: '',
                },
                {
                  text: 'فقررت اني اتجاهل اي حاجة توقفني عن اللي قررت اعمل خوضت رحلتي من بسيون لطنطا في وقت عدي ثلاث ساعات كنت هايب الطريق علي العجلة علي الرغم اني حافظه لكن لو سألتوا اهل البلد و الناس اللي بتسافر في الطريق ده هيقولولك أن طريق بسيون طنطا عاوز مهندسين يمشوا عليه مش سواقين و رحالة بالدراجة طريق صعب جدا',
                  Data_img: '',
                },
                {
                  text: 'كان أول و أسعد طلب في حياتي معقول فكرتي وصلت أن انا شخص ناجح لدرجة أن حد يطلب يتصور معايا لكن اخيرا وصلت لطنطا و دي كانت بداية البهجة اللي بدأت في حياتي حسيت أن الناس مقدرة الحاجة اللي بعملها شباب جروا عليا عشان يتكلمو معايا و اكيد في حوار عمري ما هنساه لحسن حظي : صباح الخير صباح النور الاستاذ محمد المصري صح   ايوه انا   انا الصراحة سمعت عن مبادرة الترحال اللي حضرتك أعلنت عنها و متحمس جدا ليه دي حاجة تفرحني جدا والله  ممكن اتصور معاك ',
                  Data_img: '',
                },
                {
                  text: 'بصراحة كان شعور لا يوصف لحظتها..من غير ما افكر كانت إجابتي طبعا ممكن بعدها لقيت شباب بتبص عليا و أن اي حد يتصور معايا فلقيت بعدها عدد كبير جدا جي يتصور معايا وقتها كنت عارف أن معظمهم جي لمجرد أن ده حد معروف هما ميعروفنيش اصلا بس الحمدلله دي بداية النجاح لفيت طنطا بالكامل عن طريق دراجتي و مع كل وقت بيعدي كنت بتحمس اكتر و في خلال ساعة من التفكير و التردد اني اكمل ولا ارجع كان قرارى اني اكمل المشوار اللي بدأته',
                  Data_img: require('./img/tt2.jpg'),
                },
                {
                  text: 'بدأت اقرب من الناس و اتكلم معاهم في محاولة لإيصال فكرتي ليهم و رده فعل الناس خليتني طاير من الفرحة حيث وجهتي القادمة القناطر الخيرية بمحافظة القليوبية عمري ما هنسي اليوم اللي زورتها فيه مع رحلة المدرسة فقررت ازورها من جديد بالعجلة و بالفعل انطلقت بسرعة بباقي رحلتي للقناطر الخيرية الليل عدي عليا و انا في الطريق و مبقتش عارف اعمل ايه بس كنت عايز اوصل في اقرب وقت و فعلا كملت طريقي الهادي لحد ما وصلت القناطر الخيرية',
                  Data_img: '',
                },
                {
                  text: 'كمية سعادة لا توصف بعد ما اتكلمت مع شباب لدرجة أن إحدي الحوارات كانت في الحديقة فلقيت الشباب أجروا عجل من الحديقة دي و بدأنا السباقات و لعب و مرح و قضيت معاهم اسعد يوم في حياتي و اتصورنا كتير و أخدنا ارقام بعض و كونت صداقات جميلة جدا مع شباب زي الورد و كنت فرحان جدا اني اخدت أول خطوة في حياتي كرحالة بالدراجة و بدأ حلم مبادرة هنشوف بلدنا علي العجلة',
                  Data_img: '',
                },
                {
                  text: 'و بدأت في رحلتي للعودة لبسيون بعد يوم و نص تقريبا غياب لكن الفرحة و النجاح نسوني اي تعب و كمان التعب ده اتحول لطاقة و من خلال نهاية اليوم كنت وصلت لبيتي و اهلي من جديد و ابويا اللي اول ما شاف ابتسامتي شجعني اكثر اني اكمل في المشوار و دي كانت رحلتي الأولي من بسيون مرورا بطنطا وصولاً للقناطر الخيرية لكن حابب اقول حاجة في النهاية كمحمد المصري دايما كنت بسمع أن كل شيء في أوله صعب بس معايا كان كل شيء في أوله ممتع جدا و ده اللي شجعني اني اكمل رحلاتي بالعجلة....',
                  Data_img: '',
                },

              ]

            },
            {
              item_name: 'فوة - رشيد',
              item_img: require('./img/mh6.jpg'),
              Data: [
                {
                  text: 'بعد ما حسيت قد ايه الناس تقبلت رحلتي الاولي بعد المعاناه اللي شوفتها في المعسكرات والطرق قولت لنفسي ما دام دي الحاجه اللي بحبها ليه مخليش الناس تعرفني اكتر \nواعلنت عن وجهتي الرحله التانيه علي صفحتي واللي اختارتها علشان حابب ازورها وهي مدينه رشيد بالبحيره ',
                  Data_img: require('./img/aa17.jpg'),
                },
                {
                  text: 'ولان سمعت عن جمالها وان فيها القلعه المشهوره والجبل الجميل وملتقي البحر الابيض مع نهر النيل ولكن لكم ان تتخيلوا الجمال اللي في المدينه بمجرد  ما ذكرت معالمها حاجات كتير شجعتني لزياره المدينه دي لكن الاجمل ان وانا بعلن عن وجهتي لقيت ترحيب كبير جدا واللي لفت نظري تعليق واحد من جمهوري العزيز بيقول ازاي تزور رشيد من غير ماتعدي علي مدينه المساجد',
                  Data_img: '',
                },
                {
                  text: 'مدينه المساجد؟كنت سمعت عنها مره لكن بالامانه  مكنتش اعرف ايه هي مدينه المساجد وليه اتسميت بكدا وعلي الفور استعنت بدراعي اليمين اللي هيكون رفيقي بعد كده وهو جوجل ف فتحت موبيلي وكتبت ف البحث مدينه المساجد ومن هنا كانت كميه الانبهار اللى حصللي لازم اكتبلكو ظهرلي ايه بالنص  علشان تتعرفوا علي الجوهره المصرية',
                  Data_img: require('./img/aa15.jpg'),
                },
                {
                  text: 'الا احنا مش حاسين بيها لما كتبت علي جوجل مدينه المساجد ظهرلي الآتي. "فوه مدينه المساجد والاثار الاسلاميه التاريخيه في كفر الشيخ"  تعمقت اكتر ودخلت علي رابط موجود في البحث وعرفت من خلاله ان فيه اكتر من مائة تقرير معمولين بتشهير المدينه دي خصوصا ان الكل اجمع انها  مش واخده حقها  فبدأت اقرأ مقال عن فوه بيقول الاتي  ',
                  Data_img: '',
                },
                {
                  text: '"تشتهر مصر بين دول العالم باثارها المتنوعه ولكن من العجيب ان تتواجد مدينه اثاريه تحتل المرتبه الرابعه عالميا والثالثه محليا وهي مدينه فوه بمحافظه كفر الشيخ ولكن تشتهر بالمساجد حيث تخطي عدد المساجد به حاجز ٣٦٥ مسجد لتكن هي المدينه الاولي في عدد المساجد علي مستوي جمهوريه مصر العربيه"',
                  Data_img: '',
                },
                {
                  text: 'قررت ان وجهتي ورحلتي التانيه هتكون فوه ورشيد وبالفعل بدات اجهز نفسي ل بلدين واعلنت علي صفحتي ان الرحله التانيه هي فوه ورشيد وبدات استعد لحد ما جه معاد رحلتي والا كنت متحمس ليها اكتر من اللي قبليها بسبب احتفال واهتمام الناس انهم يقابلوني في فوه ورشيد جاء اليوم اللي حددته للرحله التانيه وودعت عائلتي وانطلقت بدراجتى ',
                  Data_img: '',
                },
                {
                  text: 'طبعا الطريق علشان اوصل كان لازم اعدي علي اكتر من بلد زي مدينه بسيون وكما المدينه الجميله دسوق اللي بتقع في محافظه كفر الشيخ الطريق استغرق معايا حوالي ٣ساعات وقبل ما اوصل فوه نزلت علي صفحتي منشور كتبت فيه ربع ساعه وهكون في فوه ياترى هشوف مين وبفضل ربنا لقيت عدد تعليقات كبير خلاني مبسوط جدا ',
                  Data_img: require('./img/aa1.jpg'),
                },
                {
                  text: 'فوه دي مدينه عظيمه جدا وغنيه بالاثار زي مثلا جزيره الدهب الجزيره الا حيرتني جدا لانها حقيقي مختلفه عن اي جزيره تانيه زرتها وخصوصا يقال ان لها لغز لو اتحل تتحول الي دهب وكمان فيه نفق تاريخي تحت النيل يوصل محافظتين ببعض لكن المسؤولين  منعوني من دخوله ل خطورة مصيره ده ادهشني الحقيقه !',
                  Data_img: require('./img/aa16.jpg'),
                },
                {
                  text: ' وكمان في منطقه اسمها البوابه ودا مكان اثري ومصنع الطرابيش بتاع محمد علي باشا دي بالنسبه للاثار التاريخيه في المدينه اما عن المساجد ففي اسامي كتير مثلا زي ابو المكارم اللي بيحتوي علي متحف اسلامي رائع مسجد ابو النجاه القناوي الا من فوق المأذنه خاصه تقدر تشوف منظر صعب تشوفه من مكان تاني ',
                  Data_img: '',
                },
                {
                  text: 'وصحيت فجر اليوم الا بعده بدأت اليوم التاني منها في مدينه رشيد مريت علي مدينه مطوبس وقريه خلابه اسمها ادفينا وصولا ل رشيد البلد الاجمل ع الاطلاق بنفس الاهتمام استقبلني اهل رشيد وفرحوني ب هدايا جميله جدا وبدات اتجول مع شباب رشيد الجميل زرنا جبل رشيد فالبدايه وطلعنا الجبل مش هقدر اوصفلكم المنظر الروعه انت متخيل تكون شايف علي يمينك نهر النيل وعلي شمالك البحر الابيض المتوسط ',
                  Data_img: require('./img/aa7.jpg'),
                },
                {
                  text: 'وتشوف المدينه من فوق كان منظر عمري ماهنساه مهما حصل خدنا صور كتير من فوق الجبل ونزلنا اصطدنا سمك من النيل والبحر كمان وكانت زيارتي للقصر الابيض الملكي الحدث الابرز فاليوم الجميل دا وزرت اماكن كتير لحد ما عدا اليوم بسرعه للاسف انتهت رحلتي',
                  Data_img: require('./img/aa18.jpg'),
                },

              ]
            },
            {
              item_name: 'الفيوم',
              item_img: require('./img/mh7.jpg'),
              Data: [
                {
                  text: 'مع تجربتي الاولي والتانيه شغفي للاستمرار زاد اكتر واتحمست ان اكمل رحلاتي فكرت كتير في وجهتي القادمه وبصراحه علي قد ما كانت وجهتي كانت بعيده جدا على قد ما البلد دي بحبها جدا وكنت بحلم بزيارتها وفعلا رسمت خطتي التالته ل مدينه الفيوم سمعت كتير عن جمال البلد دي  فتحمست اكتر ان ازورها ومع اعلاني علي صفحتي الخاصه بوجهتي القادمه ',
                  Data_img: require('./img/bb18.jpg'),
                },
                {
                  text: 'لقيت تفاعل فوق الوصف من الناس بطريقه فرحتني جدا ومن وقتها بدأت اجهز نفسي ل رحلتي التالته اللي بالنسبالي كسفر بالدراجه بعيد جدا لكن شغفي تغلب علي عقبه المسافه كنت متحمس جدا للفيوم خصوصا اني بحثت علي النت وعرفت ان لازم ازور اماكن كتير ',
                  Data_img: '',
                },
                {
                  text: 'قضيت اول نهار ليا في الطريق حتي وصلت لما بعد القاهره بكتير وصلت هناك لمدينه ٦اكتوبر عسكرت واقمت الخيمه الخاصه بيا ونمت الليل كامل من تعب السفر  وصحيت صباح اليوم التاني وكملت الطريق حتي وصلت الفيوم الساعه ٥ بعد العصر استقبال عظيم من الناس وخصوصا من بعض الشباب اللي عرفت انهم موكلين بانتظاري مخصوص ودا شئ اسعدني جدا ',
                  Data_img: require('./img/bb23.jpg'),
                },
                {
                  text: 'ان شاء الله في البدايه هنروح وادي الريان ودا عباره عن اشهر محميه طبيعيه في مصر وان شاء الله تعجبك  وبعد كده هنروح ل جبل المدوره وكمان هنزور وادي الحيتان والمنطقه المقدسه.كان الجروب حوالي ٩شباب كل واحد منهم معاه دراجه خاصه بيه وبدأنا رحلتنا ووصلنا فعلا ل وادي الريان بعد نصف ساعه سير بالدراجه مش قادر اوصفلكو كم البهجه والجمال اللي هناك ',
                  Data_img: require('./img/bb10.jpg'),
                },
                {
                  text: 'بقيت اسأل نفسي الحاجات الجميله دي ف مصر معقول احنا مش واخدين بالنا من الاماكن الجميله دي وبدأ الشباب يجعلوني استمتع بكل دقيقه قضيتها في وادي الريان الاول شوفت البحيره العليا والسفلي وجمال المياه والزراعه اللي هناك حاجه مريحه للاعصاب وخصوصا ان البحيرتين دول ',
                  Data_img: '',
                },
                {
                  text: 'بيفصل بينهم الشلالات المدهشه مش بس كده دا احنا بعد ما اخدنا فلوكه فالبحيره اتصورنا واستمتعنا مطلعش وادي الريان مكون من كده وبس دا كمان فيه منطقه ليس اقل روعه من جمال الوادي وهي عيون الريان ودي ب تقع اسفل جنوب البحيره السفلي من وادي الريان وكمان محيط بالعيون دي جبال الريان من الاخر منظقه الريان هي اجمل مكان ممكن تزوره في حياتك ',
                  Data_img: require('./img/bb28.jpg'),
                },
                {
                  text: 'بس المكان هنا سحر بجد وبعد كده طلعنا جبل المدوره اللي كنت بحاول افتكر اسمه لان سمعت عنه كتير وبالفعل اتحركنا بالدراجه حوالي ٥دقايق بس ناحيه البحيره السفلي وعرفت من خلالهم ان الكسبان الرمليه و العيون الطبيعيه هتمنع حركتنا علي قدمنا الخمس دقايق قبل ما اوصل المدوره شاهدت حاجات اكتر روعه من مناظر الطبيعيه الخلابه بطريقه مدهشه ',
                  Data_img: require('./img/bb9.jpg'),
                },
                {
                  text: 'النباتات الصحراويه الطبيعيه الشلالات كل دا كوم والحيوانات البريه  اللي كنت بحلم اشوفها علي الطبيعه كوم تاني ، شاهدت حيوانات بريه زي الغزال المصري والغزال الابيض والذئاب و ثعلب الفنك وثعلب الرمال والصقور....) حاجات كنت متخيل انها في الافلام بس لكن اشوفها علي الطبيعه وفي مصر كانت حاجه مثيره للفخر والاهتمام',
                  Data_img: require('./img/bb32.jpg'),
                },
                {
                  text: 'وطبعا كنت واخد بالي ان الجبل مدرج وطبعا اكتشفت ان دا جبل مدوره طبعا لكم ان تتخيلوا ان انا واقف امام تحفه طبيعيه ربنا اختارها في مصر علشان تكون فيها قطعه من الجمال داالجبل شكله مدهش لقيت نفسي بتكلم بدون تفكير اي الجمال دا ؟',
                  Data_img: '',
                },
                {
                  text: 'فرد عليا احد الشباب :الاجمل من شكله هو عمره ياكابتن محمد \nعمره قد ايه ؟\nعمره ٤٥مليون سنه \nدهشه بانت علي عيوني جعلت الشباب يضحكو \n٤٥مليون سنه \n',
                  Data_img: '',
                },
                {
                  text: 'ايوا يقال ان دا اقدم مرتفع علي سطح الارض في تاريخ البشريه بسم الله ماشاء الله عمار يا مصر جبل مدوره اكبر من مجرد منطقه سياحيه الجبل دا في اسرار كونيه عظيمه انا بشغف زي ايه؟',
                  Data_img: '',
                },
                {
                  text: 'يعني مثلا الجبل دا موجود فوق البحر القديم الاثري يعني تكوينه جيولوجيا بيرجع لاقدم  العصور  ان لم يكن عاصر جميع العصور الجولوجيه المتنوعه منذ بدايه الخليقه ثم استكمل  وانا مندهش دا غير ان بداخله كهوف الملائكه وكمان حفريات بحريه ',
                  Data_img: require('./img/bb29.jpg'),
                },
                {
                  text: 'حضرتك تكوينه كان اعلي البحر القديم ومع مرور الزمن والتآكل والتيارات الارضيه والانخفاضات الارضيه جعلت منه جبل مرتفع عن سطح الارض  ف الحقيقه انا منبهر جدا انا مكنتش اتخيل ان مصر بالجمال دا ',
                  Data_img: '',
                },
                {
                  text: 'وبالفعل ذهبن الى مكان اشبه بالسوق كده كله تحف وهدايا رحله شراء هدايا لاهلي واصدقائي وف نهايه اليوم ذهبت ب رفقه احد الشباب للمنزل لاقامتي بيه بالامس وصباح اليوم التاني انطلقت في رحله عودتي في رحله استغرقت خمس ايام تقريبا من اجمل ايام حياتي في بلد من اجمل البلاد الارض مدينه الفيوم.......                  ',
                  Data_img: '',
                },
              ]
            },

            {
              item_name: 'الجيزة - دهشور',
              item_img: require('./img/mh10.jpg'),
              Data: [
                {
                  text: 'بعدما انتهيت من رحله الغردقه التي قضيت فيها قرابه اسبوع من الخيال حيث كل  تفاصيل المدينه دي وفي النهايه عرفنا ان الوزاره مجهزة طائرة خاصه للوفد بالكامل وبكده هوفر مجهود العودة بالدراجه من الغردقه الي الغربية',
                  Data_img: require('./img/d4.jpg'),
                },
                {
                  text: 'وهكون ف القاهرة فكرت قليلا وسألت نفسي (ازاي استغل وجودى في القاهرة) وكان الرد التلقائي علي نفسي ان استكمل رحلاتي دون توقفواتشجعت اكتر واكتر وبدات افكر ايه اللي ممكن ازوره في الجيزة ومن احنا صغيرين نعرف ان الجيزة فيها الاهرامات الثلاثه (خوفو وخفرع ومنقورع)',
                  Data_img: '',
                },

                {
                  text: 'وانطلقت بدراجتي نحو الجيزة وقررت ان بدايتي هتكون بالمكان الاقرب وهو شارع البحر الاعظم حيث المدينه الفرعونيه، وطبعا الرحله من مطار القاهرة الي شارع البحر الاعظم كانت رحله داخل رحله كانت ممتعه وانا بلف القاهرة من خلال الطريق الدائري ',
                  Data_img: '',
                },
                {
                  text: 'والامتع هو استقبال الناس ليا ومش بس كده انا لقيت ناس منتظرين بدرجات علشان تخوض معايا  الرحله دي وبالفعل وبعد ساعتين ونص وصلت للقريه الفرعونيه بالجيزة وكانت اول الاماكن في رحلتي الخامسه ومش عارفه اوصفلكم ايه بالظبط الي  في القريه الفرعونيه ودي صعب يتوصف من فرط الجمال هناك بمجرد ما دخلت وبدات اشاهد الاثار   ',
                  Data_img: require('./img/d1.jpg'),
                },
                {
                  text: 'عرفت ليه العالم كله بيتحدث عن الحضارة الفرعونيه المصريه منذ ٧٠٠٠سنه وهناك شاهدت الاثار والمومياء والمقابر الفرعونيه والعملات والملابس الفرعونيه وكل شي عن الحضارة الفرعونيه موجود هناك وطبعا زادت دهشتي  بالسؤال المعتاد معقول مصر بالجمال ده واحنا مش حاسين؟',
                  Data_img: '',
                },
                {
                  text: 'قضيت داخل القريه الفرعونيه قرابه ٣ساعات من الجمال والمتعه والخيال والفلاش باك الاف السنين ومضي اليوم بدون شعور فذهبت الي فندق في القريه الفرعونيه وحجزت اقامتي وصعدت لغرفتي وبعد تناول الواجبات الروتينيه وبدات التفكير ف كل التفاصيل، ذهبت في ثبات عميق داعيا ان يحفظ مصر بعدما عرفت قميتها جيدا',
                  Data_img: require('./img/d7.jpg'),
                },
                {
                  text: 'وفي صباح اليوم التالي استيقظت من نومي وانا مخطط لقضاء يوم جديد حيث أحد  الاماكن السياحية الرائعه في العالم واحد  عجائب الدنيا السبع وهي الاهرامات الثلاثه طبعا الاهرامات غنيه عن التعريف  فهي سحر مصري تتوارثه الاجيال علي مر الزمان وصلت الاهرامات وكان في انتظاري جروب اتعرفت  عليه وبدأنا رحلتنا بدايه من هرم خوفو المنعزل قليلا عن الباقي ',
                  Data_img: '',
                },
                {
                  text: 'حاولت التسلق الهرم ع قدر المستطاع واخذت صور كتير ليا وانا قرب المنتصف وده اللي قدرت اتسلقه بصراحه مهمه شاقه جدا وكذلك فعلت في هرم خفرع ومنقورع وكذلك ابو الهول بسحره وانفه المكسورة والاهرامات دي سحر عظمي ازاي مش حاسين بقميته بنفتخر ببناء الابراج وناطحات السحاب واحنا من الاف السنين بنيبنا ما هو اهم واعظم واعرق الحضارة ',
                  Data_img: '',
                },
                {
                  text: 'انا فخور بكوني مصري منتمي للحضارة العظيمه دي قضيت وقت كبير هناك ثم ذهبت لخان الخاليلي لشراء بعض الهدايا واستكملت رحلتي جنوبا حتي وصلت لهرم زوسر المدرج ف منطقه سقارة كنت طول عمري اسمع عن هرم زوسر المدرج لكن مكنتش اعرف ان المنطقه دي فيها عشرات الاهرام بجوار هرم زوسر غير الأهرامات الي اندثرت علي مر السنين  بفعل التعريه وخلافه',
                  Data_img: require('./img/d9.jpg'),
                },
                {
                  text: 'هرم زوسر لا يقل ابداعا عن اهرامات الجيزة عبارة عن ٧طبقات صخريه فوق بعضهم بشكل مدرج ده غير المقابر الفرعونيه بالرغم ان النهار اوشك بس كنت متحمس لاستكمال رحلتي وصلت لدهشور ، سبحان الخالق منطقه سياحيه بالاهميه دي ملايين المصريين مبيعرفوش عنه اي شي ',
                  Data_img: '',
                },
                {
                  text: 'هي تبعد عن الجيزة حوالي ٤٠كم جنوبا عباره عن هرمين ضخام جدا لكن شكلهم مختلفين تماما عن بعض الهرم الاول اسمه الهرم المنحني وقصته هي ان الملك سنوفر حاول يطبق فكرة بناء اهرامات فرعونيه ف مصر لكن الفكرة منجحتش بسبب اخطاء هندسيه ف زوايا البناء علشان كده اصبح مائل قليلا فسماه الهرم المنحني',
                  Data_img: require('./img/d3.jpg'),
                },
                {
                  text: "اما الهرم الثاني اسمه الهرم الاحمر وفعلا لونه احمر لانه مبني بطوب فريد من نوعه لونه احمر عن الصخور الاخري مبدع اللي بناه وبني ف عهد الملك سنوفر ليصبح اول هرم مصري كامل في تاريخ مصر الفرعونيه ويعد هو ثالث اكبر هرم لانه اكبر من هرم منقورع فبيأتي بعد خوفو وخفرع من حيث الحجم، حيث  الحجم ' شعرت ببرد شديد وبدات رحله العودة للفندق لقضاء ليلتي الاخيرة ف الجيزة ",
                  Data_img: require('./img/d2.jpg'),
                },
                {
                  text: "وبالفعل نمت واستيقظت اليوم التالي وزرت حديقه الحيوان والاسماك زيارة سريعه واتفرجت علي الجمال الإلهي في خلق الحيوان والاسماك وانهيت رحلتي وبدات طريق العودة لبلدي من جديد ف رحله استغرقت لنهايه اليوم علشان اكون قضيت ١٠ايام متواصله خارج بلادي ",
                  Data_img: '',
                },

              ]
            },
            {
              item_name: 'الشخلوبة',
              item_img: require('./img/mh11.jpg'),
              Data: [
                {
                  text: "قضيت قرابة  الاسبوعين بعد عودتي من الجيزه ودهشور بصراحه الجمال اللي شفته يكفي  اني  افضل عايش على ذكرياتي  في الايام دي ' لكن شغفي  وجمهور اللي اصبح يتسائل عن رحلتي الجديده' جعلوني استعد لسادس رحلاتي علشان كده رحلتي السادسه هتكون قرية ريفيه في احدي البقاع السحريه في مصر وهي قريه الشخلوبه مركز سيدي سالم محافظه كفر الشيخ",
                  Data_img: require('./img/dd2.jpg'),
                },
                {
                  text: 'وفي خلال الثلاث ايام حضرت نفسي وكل اغراض لقضاء اليومين وانطلقت بعد صلاه الفجر بدارجتي علي  طريق (بسيون - دسوق _سيدي سالم) الناس في الطريق استقبلتني احسن استقبال وخاصه  ان مش اول مره اخذ الطريق ده حتى الوصول لدسوق الطريق مكنش طويل جدا لان كان حوالي 60 كيلو لغايه مدينه سيدي سالم ',
                  Data_img: '',
                },
                {
                  text: 'استغرق مني ساعتين بالدراجه تخللهم راحه وتصوير على الطريق، و الطريق من سيدي سالم لقرية الشخلوبه  استغرق  حوالي الساعه بالدراجة  حتى وصلت للقريه، وبالرغم ان كل رحله  ليا بيتم  استقبالي احسن استقبال ولكن استقبال اهل الريف يختلف تماما عن اى استقبال اخر فعلا اهل الريف خلوني افتخر اني فلاح وريفي ',
                  Data_img: require('./img/dd3.jpg'),
                },
                {
                  text: "احدى العائلات استضافوني  لتناول الغداء وكان اكل رائع جدا و تحدثنا كثيرا ثم بدات رحلتي فعليا بصحبة  ابن صاحب المنزل  اللي استضافني وكان اسمه امير'  اتحركنا من منزلهم واتجهنا الي  شاطئ النيل وركبنا قارب خشبي وعرفت من امير ان كل عائله لابد ان تمتلك قارب خشبي زي ده  وبيسموه مركب ، ركبنا القارب",
                  Data_img: '',
                },
                {
                  text: 'وبدا امير التجديف نحو الجزر وصلنا الى احدى الجزر وقال لي ان اسمها جزيره عبد الشافي مهنا كانت جزيره صغيره ولكن كانت عامره بخيرات الله وفيها بعض المنازل وفيها موطن الكثير من الطيور المهاجره زي النسور. وطبعا اتصورنا هناك كثير وانا حقيقي مبسوط بالجمال ده ',
                  Data_img: require('./img/dd5.jpg'),
                },
                {
                  text: 'وبعدها روحنا جزيره جمال حلمي كانت اكبر شويه من عبد الشافي مهنا وفيها منازل ومحلات وحياه كامله كان اهلها كلهم بيشتغلوا في مهنه الصيد اللي استقبلوني كويس جدا وقدموا ليا اسماك كثير جدا وكنت مبسوطه و بصراحه اجمل ما في البلد دي مناخها الرائع واللي يرد الروح بمعني الكلمه',
                  Data_img: '',
                },
                {
                  text: "طبعا طبيعة اهل الريف ان قرب اذان المغرب الكل بينهي عمله' وبالفعل عدت مع امير منزلهم واقمت الليل معاهم وفي صباح اليوم الثاني بدات رحلتي بعدما شكرت صاحب المنزل وامير واللي كسبتهم كاصدقاء . وانطلقت نحو بحيره البرلس، طبعا قريه الشخلوبه بتطل مباشرة علي بحيره البرلس ولكن معلوماتي السابقه عن بحيره البرلس جعلتني حابب اشوف البحيره ",
                  Data_img: require('./img/dd1.jpg'),
                },
                {
                  text: 'اتفقت مع احد  ملاك القوارب  انه يبقى معي اليوم كله ويفرجني على بحيره البرلس وبالفعل شاهدت حجات  جميله جدا المياه النقيه والصيادين و مزارع السمك والصناديق واللي يتم فيها تربيه الاسماك و كانت حياه ثانيه خالص وشواطئ البحيره اللي بتربط اربع مراكز من محافظه كفر الشيخ مع بعض فعلا فوق الوصف قضيت النهار حتى العصر ورجعت مودعا الشخلوبه و بحيره البرلس واهلها الطيبين على نهايه اليوم كنت في منزلي  ',
                  Data_img: '',
                },


              ]
            },
            {
              item_name: 'الواحات البحرية',
              item_img: require('./img/g16.jpg'),
              Data: [
                {
                  text: 'بالرغم من قصر الرحله السادسه ولكن كانت ممتعه ،شئ جيد لما تشوف جمال طبيعه بلدك بعنيك قضيت حوالى اسبوع بمارس شغلتى الاساسيه وبعمل ديكورات بالخشب وبقيت مشهور فى بلدى بسمع كثيرا عن الواحات وجمالها لكن عمرى ما فكرت ازورها ',
                  Data_img: require('./img/g15.jpg'),
                },
                {
                  text: 'لكن سألت نفسى هو انا ليه مروحش الواحات واشوف جمال الطبيعه فى الصحراء الغربيه اللى بتمثل نسبه كبيره من مصر',
                  Data_img: '',
                },
                {
                  text: 'انطلقت بعد صلاه الفجر مودعا والدتى ووالدى وحتى اولادى رحلت خلال النهار ووصلت فى خلال يوم ونصف بالدراجه يتخللهم بعض ساعات الراحه بالرغم من تعب المشوار لكن حماسى كان شديد جدا وصلت الحمد لله بعد عناء يوم ونص سفر واستقبلنى الجروب اللى اتعرفت عليه وكانوا شباب جميل جدا بصراحه بعيدا عن متعه السفر والجمال اللى تشوفه بس كسبت ناس كتير بقوا اكتر من اخواتى اتعرفت على الجروب وبدانا حديثنا ',
                  Data_img: require('./img/g35.jpg'),
                },
                {
                  text: 'الواحات البحرية بالصحراء الغربية تعتبر أحد أهم المعالم الجيولوجية المصرية وتم إعلانها كمحمية طبيعية مساحتها: 109 كم2. ,هي إحدى واحات الصحراء الغربية في مصر، وتتبع محافظة الجيزة، وتقع على بعد 365 كيلومتر إلى الجنوب الغربي من الجيزة، يربطها بالجيزة والقاهرة الكبرى طريق القاهرة الواحات الصحراوي، وهي تقع على منخفض مساحته أكبر من 20000 متر مربع، ويوجد بها نحو 400 عين للمياه المعدنية والكبريتية الدافئة والباردة، مركزها مدينة الباويطي.',
                  Data_img: require('./img/g36.jpg'),
                },
                {
                  text: 'من أهم المعالم الأثرية بالواحات البحرية مقابر الأسرة السادسة والعشرين، وجبانة الطيور المقدسة وبقايا قوس النصر الروماني، وأطلال معبد إيزيس، وأطلال معبد يرجع إلى عصر الإسكندر الأكبر كما تحتوي على مقبرة وادي المومياوات الذهبية.عُثر على هيكل ديناصور في الواحات البحرية عام 1912م، وحفظ في متحف ميونيخ في ألمانيا، إلا أن المتحف دمر أثناء الحرب العالمية الثانية وضاعت معظم أجزاء الديناصور، وتبقى بعض الصور الفوتوغرافية والرسومات التي رسمها له العالم الجيولوجي الألماني {شترومر}.',
                  Data_img: require('./img/g12.jpg'),
                },
                {
                  text: 'الصحراء البيضاء\nتخيل انك تمشى فى مكان على سطح الارض كان يوما من الايام قاعا للبحر ...انها احدى كنوز مصر الرائعة بل والفريدة على مستوى العالم انها الصحراء البيضاء والتى تقع على بعد 35 كيلو متر قبل واحة الفرافرةوتقع الصحراء البيضاء إدارياً في نطاق محافظة الوادى الجديد التى تضم الواحات الثلاث؛ الفرافرة، الداخلة، وتنتهى بالخارجة عاصمة المحافظة. وهى جغرافياً نطاق كبير يربو على 3000 آلاف كيلو متر مربع',
                  Data_img: require('./img/g16.jpg'),
                },
                {
                  text: 'والصحراء البيضاء عبارة عن تكوينات رسوبية وطباشيرية تكونت بفعل رسوبيات الكائنات البحرية التى درجت وعاشت بالمنطقة منذ ما يزيد على 40 مليون سنة، عندما غطى المحيط (التيثى) العظيم، والذى كان امتدادا للبحر المتوسط، الجزء الاكبر من الصحراء الغربية المصرية، وذلك يفسر وجود القواقع البحرية بها وأجزاء من الشعاب المرجانية في الصحراء الممتدة من البحر المتوسط في الشمال وحتى صعيد مصر في الجنوب.',
                  Data_img: require('./img/g3.jpg'),
                },
                {
                  text: 'وترجع روعة الصحراء البيضاء كمتحف طبيعى أن النحات في هذه الحالة كان الطبيعة، فبعد الجفاف الذى أصاب المنطقة قبل ملايين السنين وبسبب تراجع البحر، ظلت تلك الصخور عُرضة للتعرية والنحت بفعل الرياح المحملة بالرمال والتى صاغت أشكال الصخور بلا خلل كأروع ما يكون الفن، ولزائر المنطقة بما له من خيال خصب وقريحة مستثارة بسسب ما يراه من إبداع، أن يتخيل ما تراه عيناه من أشكال فنية لا تحتاج دراية فنية ولا خلفية علمية إلا ما تحويه قريحة الإنسان من حب فطرى للجمال وتقدير لبديع صُنع الرحمن جل وعلا.',
                  Data_img: '',
                },
                {
                  text: 'تعد الواحات البحرية أهم المناطق التي يلجأ إليها العديد من مرضي الروماتيزم والأمراض الجلدية سواء من المصريين أو الأجانب للاستشفاء. حيث تشتهر الواحات بوجود الكثير من العيون وآبار المياه الكبريتية، والتي يصل عددها إلى 398 عينا تشتهر الواحات بوجود الكثير من العيون وآبار المياه الكبريتية، والتي يصل عددها إلى 398 عينا',
                  Data_img: require('./img/g22.jpg'),
                },
                {
                  text: 'وتتراوح درجة حرارتها من 30 إلى 70 درجة مئوية. ومن أشهر تلك الآبار: بئر عيون حكيمة، وعين الحلفا بالباويطي، وهي تعالج الأمراض الجلدية، وتقلل من أعراض الذئبة الحمراء.تحتوي هذه الينابيع الطبيعية على أعلى نسب الكبريت مقارنة بالأبار المنتشرة في العالم، بالإضافة إلى العديد من الأملاح المعدنية ومعادن ذات قيمة علاجية مثل كربونات الصوديوم والماغنسيوم والحديد، فضلا عن أنها متوسطة الملوحة.',
                  Data_img: '',
                },

                {
                  text: 'ويوجد بالواحات البحرية ايضا جبل الكريستال اغلي واغني جبال العالم موجود جوه مصرقع داخل الصحراء البيضاء على بعد 120 كيلومتر من واحة الفرافرة، و160 كيلومتر من الواحات البحرية، يُعتبر من أندر الجبال في العالم، فهو عبارة عن جبل كامل من خامات الكريستال المختلفة، حيث يوجد به أكثر من 12 نوع من أنواع الكريستال، تتجمع مع بعضها البعض في كتلة جبلية ضخمة',
                  Data_img: require('./img/g10.jpg'),
                },
                {
                  text: 'الجبل مجرد تلال متوسطة الحجم مُبعثرة ومنتشرة بين الواحة البحرية، وهو أغلى جبال العالم، قوس صغير من الصخور، تألقه الباهر تحت أشعة الشمس، يجعله كتاج مزدان بالآلاف من الجواهر الملونة وسط الصحراء، جعله كنز يلهث وراءه كل باحث عن الثراء، وهذا ما يجذب إليه الكثير من السائحين والمحليين، فعادة ما يرغب الزائر إلية للحياة وسط جواهره المبعثرة في منظر فريد من نوعهكان جبل الكريستال عبارة عن كهف كامل من الصواعد والهوابط، ومع مرور الزمن ونتيجة لعوامل التعرية، فقد هذا الكهف سقفه',
                  Data_img: require('./img/g7.jpg'),
                },
                {
                  text: 'الصحراء السوداء\nتعد الصحراء السوداء إحدى أجمل المعالم السياحية فى مصر، إذ تكونت من عوامل جيولوجية جعلت منها معلما سياحيا جميلا، لا مثيل له فى العالم. تبعد الصحراء السوداء قليلا عن شمال الصحراء البيضاء، وهى قريبة من الواحات البحرية أكثر من واحة الفرافرة، بحيث تبعد 50 كم تقريبا جنوب مدينة البويطى.',
                  Data_img: require('./img/k13.jpg'),
                },
                {
                  text: 'تآكلت الجبال لتغطى الصحراء بطبقة من المسحوق الأسود والصخور مما منح المكان اسمه، وعند طرف الصحراء السوداء توجد تلال بركانية سوداء، ثارت منذ عصور ماضية، وأخرجت مادة بركانية تسمّى الجاسبر، وهى المادة التى تتكوّن منها الصخور السوداء. يمكن رؤية الصحراء السوداء فى أثناء عبور الطريق من الواحات البحرية إلى واحة الفرافرة، ولكن إذا كنت ترغب فى خوض مغامرة فى داخلها، فإننا ننصحك بجولة إرشادية، ويمكن الترتيب للجولات بسهولة سواء من الواحات البحرية أو واحة الفرافرة.',
                  Data_img: require('./img/g25.jpg'),
                },


              ]
            },
            {
              item_name: 'اسيوط',
              item_img: require('./img/mh13.jpg'),
              Data: [
                {
                  text: 'بعد رحله ممتعه جدا ممتن لكل لحظه عشتها وبعد زيارة الواحات البحرية استمريت اسبوع ونصف راحه وتفكير في العودة مرة اخري واستكمال الرحله من جديد لكن المسافه خلتني افكر شويه وفي نفس الوقت محتاج ازور اماكن كتيرة في مصر وفي يوم جالي مكالمه مهمه جدا.كنت متحمس لزيارة الصعيد جدا قررت ان رحلتي الثامنه ان شاء الله هتكون في محافظة اسيوط ',
                  Data_img: require('./img/e3.jpg'),
                },
                {
                  text: 'مع فجر يوم 9 اكتوبر انطلقت بدراجتي نحو طريق القاهره ومن ثم طريق الصعيد في خلال يوم ونصف كنت وصلت اسيوط الحمد لله.طبعا حابب احكي لكم حاجه لاول مره عناء السفر والتخييم في الطرق الخطيره صعب جدا كفيل يخليني اتوقف عن طموح الترحال ومكملش لكن اصراري وعزيمتي تفوقت  علي  اي محاوله احباط او صعبات ',
                  Data_img: '',
                },
                {
                  text: 'وخصوصا البلاد البعيده اللي بلجأ اخيم طول الليل على الطريق معرض للسرقه و معرض لاشياء كتير خطره،وطبعا كان صعب ان اقضي كل ليله في فندق خاص لان انا مش بكسب ماديا من رحلاتي، لذلك كان من الصعب اقامتي بالفنادق الخاصه لذلك كنت بصطحب خيمتي وبخيم في اي مكان امان بالنسبه لي.',
                  Data_img: '',
                },
                {
                  text: ' بالفعل وصلت اسيوط الحمد لله واستقبلني احمد قائد الجروب اللي كان في استقبالي فور وصوله تعرفت على الجروب كان شباب خلوق جدا وعرفونى رجوله الصعايده على حق، اقامت في منزل احد الشباب وتناولنا الطعام وبدأنا نتكلم عن الرحلات.وقررنا نزور الاماكن شمال اسيوط واتجاه المنيا واللي غنيه بالمزارات جدا زي  مقابر مير الاثريه و مسجد ابو العيون ودير صرابامون  في ديروط وكمان هنزور دير الجبراوى في ابنوب',
                  Data_img: '',
                },
                {
                  text: 'وفي صباح اليوم الثاني قمنا وتناولنا فطارنا وتحركنا بالدرجات لبداية  مشوار الرحله الثامنه، واتجهنا للشمال وكاني راجع مره ثانيه لبلدي مشينا  قرابة  ساعه ونص وصلنا لمدينه القوصيه على بعد 65 كيلو متر من اسيوط وهناك اتجهنا لمقابر تسمي مقابر مير الاثريه ودي كانت مقابر داخل الجبل عاوز اقولكم ان الصعيد فعلا غني بالجبال والاثار',
                  Data_img: '',
                },
                {
                  text: 'كانت مقابر مير عباره عن مقابر منحوته بطريقه جميله جدا وكل مقبره برسمه عظيمه مختلفه ،ويقال ان المقابر دي كانت مقابر عاصمه الدوله الفرعونيه القديمه و ان تم تغيير  اسمها لدى الرومان باسم ( كوساي) وكانت معبد للاله زي الاله (حتحور) كانت جميله فوق الوصف وكمان عرفت من احمد ان القدماء استخدموها  كمقر  للاحتفالات والاعياد والطقوس الدينيه والاثاث الجنائزي كانت الوانها زاهيه لدرجه ده انا اعتقدت انها عصريه حديثه ',
                  Data_img: require('./img/e4.jpg'),
                },
                {
                  text: 'قضينا هناك قرابة  الساعتين واتصورنا كثير جدا مع مكان بديع فعلا والجبل كان مذهل بطريقه خرافيه. بعدها اتحركنل من القوصيه وتحركنا نحو ديروط حيث  قريه دشلوط و مسجد (ابو العيون) عرفت معلومه مذهله عن المسجد ده وهي ان المسجد ده بيطلق عليه " عطر النبي" صلى الله عليه وسلم في مصر ',
                  Data_img: require('./img/e5.jpg'),
                },
                {
                  text: 'كان اسمه يرجع للشيخ ابراهيم ابو العيون المسجد ما كانش اثري لأنه مصمم منذ قرابة ال 200 عام فقط ولكن بيحظي باهميه كبيره جدا من خلال الضريح اللي هناك والكرامات  واللي الكثير بيؤمن بها ، كان المسجد  ضخم جدا مصمم بطراز اسلامي مميز  ،حبيت المكان ده جدا فيه راحه نفسيه كبيره جدا',
                  Data_img: '',
                },
                {
                  text: 'كان المسجد مقسوم نصفين الجزء الاول وهو المسجد وهو مكان المصلين والاخر كان خاص بمقام  الشيخ ابراهيم ابو العيون  بعد ساعه الا ربع داخل المكان الرائع ده تركنا القريه بعد  ما اهلها صمموا  علي  تناول الغداء معهم وبالفعل اتغدينا مع اهل القريه وتحركنا مره ثانيه لكن متحركناش كثير لان بعد 15 دقيقه تقريبا بالدراجه وصلنا لمدينه ديروط حيث دير الانبا "صرابامون" ',
                  Data_img: '',
                },
                {
                  text: 'او كما تسمى بالشجره الساجده كان دير للأقباط مشهور جدا وبداخل الدير شجره على شكل سجود بيعود عمرها لقرابة  2015 سنه اي  قرب مولد السيد المسيح عيسى عليه السلام، وللشجره دي اهميه كبيره جدا دينيه وتاريخيه كبيره جدا حيث ان الشجره دي استكنت تحت ظلها السيده العذراء مريم وسميت  ب ام النور ومازالت الشجره تنمو حتى اليوم بشكل مبهر الشجره دي كفيله تدل على عظمه خلق ربنا سبحانه وتعالى',
                  Data_img: '',
                },
                {
                  text: 'بعد نصف ساعه تأمل للشجره وبقرب  انتهاء النهار  اتحركت رفقه الجروب حتى منطقه ابنوب بالقرب من مدينه اسيوط حتي وصلنا لدير الجبراوي و ده بيقع على النيل مباشره وده كان عباره  عن مقابر محفوره في الصخر يرجع تاريخه الى عصر الدوله القديمه كانت مصممه بطريقه رائعه جدا كان كل  قبر منقوش ومخطط بطريقه احترافيه تدل على عظمة القدماء المصريين',
                  Data_img: '',
                },

                {
                  text: 'ثم اتجهنا نحو قريه ريفا ودي كانت من على حدود مدينه اسيوط بمجرد دخول القريه كان بيبدو  انها قريه اثريه منظر المنازل قديم الابواب الاثريه فاتحمست  جدا  وعرفت ان هناك في مكان يدعى دير ريفا ويحتوي على مقابر دير ريفا الاثريه واللي بيرجع عمرها لقرابة   ال 4000 عام ',
                  Data_img: '',
                },
                {
                  text: "وده عباره عن مجمع كنائس زي كنيسه العذراء والجبل وكمان الدير بيحتوي علي كنيسه الامير تادرس وبيحتوي على مقابر اثريه ضخمه جدا واللي منها قبر اخين الاسره الثامنه  وفي واحد من اضخم المقابر الفرعونيه عبر التاريخ وانا كمان اتعمل ابحاث علميه عن هويه الاخين الغير اشقاء ، كان مكان مبهر الحقيقه اتصورنا هناك مع اهل القريه'  وغادرنا  متجهين  للمنطقه الغربيه ",
                  Data_img: require('./img/e10.jpg'),
                },
                {
                  text: 'حيث الجبل الغربي واللي كان قريب جدا من مدخل اسيوط الغربي، وده كان عباره عن جبل ضخم  يضم العديد من المقابر والمداخل والاستناد مخصصه مخصصه لحكام وامراء الإقليم الثالث عشر  في العصور  الفرعونيه الاولى والوسطى وكمان عرفت انك الجبل كان بيحتوي على آثار وتحف  اثريه  متاحه في جميع متاحف العالم وبيرجع العثور عليها خلال ذلك الجبل',
                  Data_img: '',
                },
                {
                  text: 'كان عدد  مقابر كبير  جدا واهم المقابر اللي كانت في المكان ده  مقبرة " نخني وب" ومقبرة  "امون حتب" ويقال  ان المنطقه دي بمثابة النهايه الحتميه لوجود العائله المقدسه، خرجنا من الجبل الغربي واتجهنا داخل مدينه اسيوط وذهبنا مع قرب نهايه اليوم الي مسجد المجاهدين واللي يعتبر من افضل المساجد و اكبر المساجد المعلقه في اسيوط ',
                  Data_img: '',
                },
                {
                  text: 'وأيضا  يعتبر من اقدم المساجد واللي يتواجد على صخره عاليه تسمي  ربوه عاليه ، مأذنته تعتبر اهلي مأذنه في الصعيد كله كانت مزخرفه ورائعه جدا وكان بجانب المسجد تكيه تحتوي على الكثير جدا من الاثار الاسلاميه العظيمه بصراحه، صلينا العشاء في مسجد المجاهدين وعدنل مره اخرى للمنزل بعد نهايه اليوم قبل الاخير ',
                  Data_img: '',
                },
                {
                  text: "وانطلقنا  بالدرجات وغادرنا  مدينه اسيوط وسرنا قرابة  10 دقائق حتي وصلنا  مركز الفتح واللي كان قريب جدا من اسيوط والبدايه هناك كانت زياره المسجد الاموي كانت مساحة المسجد كبيره  جدا  قرابه 3000 متر  تقريبا يرجع اصل المسجد للدوله الايوبيه كان المسجد محاط بالكامل بالايات القرانيه واسماء الله الحسنى' وكانت ابوابه ضخمه جدا كان مصمم بطراز اموي عظيم جدا كان حجمه كبير جدا الحقيقه",
                  Data_img: '',
                },
                {
                  text: "كان يحتوي على عدد كبير جدا من العواميد المصممه بشكل حلزوني رائع من اجمل مساجد اللي شفتها في حياتي غادرنا المسجد الاموي وذهبنا لقنطره المجذوب في نفس المكان مركز الفتح ' احمد اخبرني ان قنطره المجذوب هي اهم منشاه مائيه في عهد محمد علي باشا اللي بيرجع اصلها العصر العثماني كان عباره عن ثلاثه عيون علي  امتداد نهر النيل ",
                  Data_img: require('./img/e11.jpg'),
                },
                {
                  text: 'وكمان مخصصه لصرف مياه الري كان في غايه في الروعه تشبه لحد كبير القناطر الموجوده في محافظه البحيره مركز رشيد في الرحله الثانيه.بعد كده غادرنا مركز الفتح  وانطلقنا  قرابة الساعه سفر قال لي احمد اللي في الاتجاه جنوب غربي وصلنا مركز البداري وزرنا المقابر الهماميه مقابر اثريه قديمه جدا بيعود تاريخها  لعام 5000 قبل الميلاد يعني منذ بدايه الحضاره الفرعونيه',
                  Data_img: '',
                },
                {
                  text: 'وكانت تحتوي على على مقر محاكمه  هو الاقدم في تاريخ البشريه ، ودي كانت عباره عن مقابر صخريه منحوته داخل الجبل الشرقي في العصور القديمه يرجع تاريخها الى 7000 سنه قضينا وقت رائع هناك ثم تحركنا نحو الوجهه الاخيره في رحلتي الثامنه ',
                  Data_img: '',
                },
                {
                  text: 'حيث اتجهنا  نحو مركز الغنايم وده اخر حدود اسيوط محافظه سوهاج واللي كان عباره عن دير ضخم لكنائس كثير من الاقباط واللي زرناها زياره سريعه ، ثم ودعت  الجروب بامنيات تجدد اللقاء. وانطلقت لرحلتي التاسعه لزهرة  الجنوب اسوان .....',
                  Data_img: '',
                },
              ]
            },
            {
              item_name: 'اسوان',
              item_img: require('./img/mh15.jpg'),
              Data: [
                {
                  text: ' طبعا مسافه السفر دى تعتبر هي الاطول بين رحلاتي الماضيه لذلك قررت استكمال رحله اسيوط ومن ثم الى اسوان طبعا خلال يومين كاملين سفر بالدراجه مريت على محافظات جميله جدا زي سوهاج وقنا والاقصر طبعا ',
                  Data_img: require('./img/t1.jpg'),
                },
                {
                  text: 'واتحركنا بالدراجه نحو طريق النوبه ووصلنا لارض الذهب كما يطلق عليها بعد قرابه الساعه بالدراجه وصلنا واتمشينا على النيل بالدراجات وصولا لمرسى القوارب في النوبه وفعلا ركبنا قارب وخضنا اجمل رحله نيليه ممكن اعيشها في حياتي ماشي في النيل والجبال حواليك كان المنظر خلاب ميتعوضش الحقيقه وصلنا بعد ما قضينا في القارب حوالي نصف ساعه بنلف وبنتصور ',
                  Data_img: ''
                },
                {
                  text: 'وصلنا لجزيره (اجليكا) او جزيره الجمال لانها تستحق الاسم ده كانت تحفه الهيه على الاراضي المصريه ،فوق الوصف،وبدأ ادهم يوصفلي ويحكيلي عن الجزيره وتاريخها وانا مستمتع جدا،أشتهرت الجزيره بعد نقل معبد فيله واللي غرق بسبب الفيضان في مطلع القرن العشرين وتسمي جزيره فيله لانها بتضم معبد فيله ',
                  Data_img: ''
                },
                {
                  text: 'وكان برضه بيطلق عليها عشق ايزيس ومهد الكنيسه كانت الجزيره طوليه موازيه لنهر النيل وكانت بتضم معبد فيله اللي زرناه بعد ما لفيت على شاطىء الجزيره مستمتعا بالمنظر الطبيعي ده وطبعا اللي مقرأش حكايات ليله وليله واسطوره انس من هيعرف قيمه فيله كويس كان معبد فيله هو المخصص للاله ايزيس ولكن للاسف الفيضان قضى عليه قبل مايعاد بناءه مره اخره ',
                  Data_img: require('./img/t6.jpg'),
                },
                {
                  text: 'كان اعظم مكان ممكن يطبق عليه ظاهره الصوت والضوء ومكنش معبد فيله فقط هو الي على جزيره اجيلكا، كان مكان كتير من المعابد اللي بترجع لعهد الملك تحتمس التالت في القرن الربع قبل الميلاد وكمان كان فيه تماثيل كثيره جدا لاهم ملوك العصر الفرعوني في العصور ما قبل الميلاد كان المشهد من الجزيره دي فوق الوصف',
                  Data_img: ''
                },
                {
                  text: 'انت بتشوف الاثار المصريه بعنيك وكمان الشلالات اللي كانت موجوده هناك كانت حاجه فوق الوصف خرجنا من معبد فيله ،اخدنا القارب مره تانيه ومشينا بعرض النيل حتا وصلنا لجزيره اخري اصغر من اجيلكا وهي جزيرة " سهيل" لكن كان فيها كميه صخور كبيره جدا واخبرني ادهم انها تعتبر اهم مدن وقري التابعه للنوبه ولانها تحتوي على اثار دينيه كثير جدا وكانت تعتبر قريه سياحيه لذلك اهل النوبه بيعتبروها مزارا سياحيا اساسيا ',
                  Data_img: require('./img/k8.jpg'),
                },
                {
                  text: 'وكانت كمان بتضم المعبد المصري القديم واللي كان بيضم مجموعه كبيره من الاثار الفرعونيه وكمان لوحه المجاعه الشهيرهودي كانت عباره عن صخره منحوته و كأنها رسمه بتتحدث عن سبع سنوات عاشتهم مصر القديمه من الجفاف والمجاعه وبترجع لفتره حكم الملك زوسر ',
                  Data_img: ''
                },
                {
                  text: 'وكان شرح اللوحه الجزء العلوي يقدم زوسر القرابين لثلاث الهه مصريه وهم "خنوم وساتيس وانوخيت" كانت منحوته بشكل لا يصدق الحقيقه وكمان في جزيره سهيل (جميله طرم) ودي عباره عن قناه مائيه بترجع لعصر الملك سنوسرت الثالث،كانت حاجه فوق الخيال بصراحه ركبنا القارب مره اخرى وبرضه في نفس الاتجاه علشان نوصل لجزيره ثالثه وهي جزيره النباتات ',
                  Data_img: ''
                },
                {
                  text: 'وصلنا لجزيره النباتات كانت لا تقل جمال عن جزيرتي اجيلك وسهيل وهي عباره عن اقدم الحدائق في العالم اجمع الجزيره كلها عباره عن حديقه نباتيه وبتحتوي عن مجموعه كبيره جدا من النباتات والاشجار النادره اللي معظمها انقرض فعليا من العالم كانت تعتبر مزار لاهم شخصيات العالم القديم والحديث ',
                  Data_img: require('./img/t8.jpg'),
                },
                {
                  text: 'كانت بتشمل مساحه١٧فدان وكانت بتضم نباتات كتير ذكرلي ادهم اهمها (الابنوس _الماهوجني_الباباط_الصندل_السوك_التمر هندي_القرنفل_الزنجبيل_المردقوش_الدوم_البلح)وغيرها من النباتات والاشجار لذلك ليها اهميه كبيره جدا للنوبيين ولذلك تعتبر احدى اهم المزارات السياحيه في النوبه وخصوصا موقعها الجفرافي وسط نهر النيل .',
                  Data_img: ''
                },
                {
                  text: 'النهار خلص الحقيقه واحنا في جزيره النباتات لكن اخبرني ادهم ان الاماكن الباقيه متعتها في الليل وفعلا عدنا لشاطىء النوبه واكلنا هناك قبل منكمل رحلتنا في مدينه النوبه الرائعه ولكن من كرم اهل النوبه اصرو على المبيت هناك ولان الوقت اتاخر لان مواعيد حياتهم نهاريه لذلك من المؤكد اننا هنلاقي باقي اماكن النوبه مغلقه ولصعوبه العوده في الليل فعلا وافقنا على الاقامه في احد منازل اهل النوبه',
                  Data_img: '',
                },
                {
                  text: 'توجهنا بدراجاتنا لمتحف النوبه وده عباره عن متحف مؤسس عن طريق هيئه اليونسكو في النوبه ليكون عاصمه  المنظمه في جنوب مصر ، وده عباره عن متحف بيضم كل تاريخ النوبه العظيم والعريق وبالرغم  ان المتحف حديث عمره حوالي٢٥عام ولكن بيضم معلومات يرجع تاريخها لألاف السنين ',
                  Data_img: '',
                },
                {
                  text: 'كان المتحف مهيأ للزياره الكامله وكان مكان بيضم اكثر من٥٠٠٠قطعه اثريه واصفة مراحل تكون بين الحضاره المصريه والتراث النوبي العظيم وكمان كانت بتضم قطع اثريه ضخمه ويرجع تاريخهاا ل٢٠٠ الف سنه انتو متخيلين يا جماعه ٢٠٠الف سنه ويتم اكتشافهم في مصر  كمان  كان بيضم تمثال الملك رمسيس التاني ومقصوره قصر ابريم ،ونموذج لمعبد فيله ،واحد لوحات امنتحب ،وقبور للحكام والالهه في عهد الفراعنه ',
                  Data_img: ''
                },
                {
                  text: 'وكمان تمثال الملك خفرع يعني بإختصار ،كان. متحف النوبه عباره عند موسوعه تاريخيه عن عصور واثار مصر القديمه والوسطي والحديثه ايضا،فقضينا قرابه الساعتين ونصف في متحف النوبه وتحركنا قرابه الساعه حتى وصلناا لمعبد ابو سمبل كان بيقع في منتصف المسافه بين النوبه وبحيره ناصر في اسوان ',
                  Data_img: ''
                },
                {
                  text: 'ويعتبر كمان احد منظمات اليونسكو في مصر ،وبيرجع معبد ابو سمبل بمصر للملك رمسيس التاني وكان بيضم عدد هائل من الاثار والتماثيل وكان بيضم معابد داخليه عظيمه وبيحكى ان معبد ابو سمبل هو احد ابرز المعالم الاثريه في العالم  فقضيا هناك اكتر من ساعه وانتهينا من اثار النوبه بعد يوم ونصف من المتعه اللامنتهيه ',
                  Data_img: require('./img/t4.jpg')
                },
                {
                  text: ' وهكذا انتهى يومنا وعدنا الى منزل ادهم وفى صباح اليوم التالى واتحركنا اتجاه النيل واخذنا قارب في النيل مثلما فعلنا بالامس في النوبه واتحركنا نلف النيل قرابه ساعه وبعدها اتجهنا نحو جزيره(إلفنتين)ودي كانت مشهوره بصناعه العاج والفيله عشان كداا سموها اليونان ب(الفنتين)اي(اسنان الفيل العاجيه)،كانت على قد انها صغيره المساحه ولكن كانت جميله جدا',
                  Data_img: ''
                },
                {
                  text: 'وكانت بتضم عدد كبير من المعابد وده لان الجزيزه دي عمرها الاف السنين اي شهدت علي جميع العصور المصريه التاريخيه منذ الفرعونيه وحتى الاسلاميه كانت المعابد هناك تعود لاله الفيضان (سانت)وعدد المعابد كان٥معابد اولهم بيعود لعام٢٨٠٠ق.م اي الاسرتين الاولى والثانيه التاريخيه ',
                  Data_img: ''
                },

                {
                  text: 'خرجنا من المعابد الخاصه بجزيرة الفنتين وذهبنا لمتحف اسوان على نفس الجزيره الرائعه الغنيه بالاثار، كان متحف اسوان بيطلق عليه متحف (الفنتين)نظرا للجزيزه الموجود عليها المتحف ، كان عمر المتحف منذ قرابه١٠٠عام او اكثر وبيضم عدد كبير جدا من اثار النوبه واسوان وكمان بيضم اثار يقال ان يرجع عمرها لعصر ما قبل الاسرات يعني الاف السنين قبل الميلاد وفيه مكان لعباده الاله(حتوم وساتت)،كان المتحف جميل جدا',
                  Data_img: ''
                },
                {
                  text: 'في الحقيقه من جمال جزيره الفنتين قضينا النهار كله هناك نتصور ونتمشي وعدنا في الليل من اجل النوم استعدادا لليوم التالي واللي كنت متحمس جدا لزيارته،وفعلا في صباح اليوم التالي استيقظنا وانطلقنا لمدينه كوم امبو ،بصراحه طول عمري اسمع عن متحف كوم امبو ومتحمس جدا لزيارته وصلنا بعد قرابه ساعه للمدينه ومن ثم لمعبد كوم امبو كان معبد كوم امبو بيعود لعصر الملك بطليموس السادس وبناه خصيصا لعباده الالهه ( سوبيك وحورس) ',
                  Data_img: ''
                },
                {
                  text: 'كان المعبد ضخم وبيضم اعمده ضخمه جدا وده اللي اشتهرت بيه دوله البطالمه وكان بيحتوي على كثير من اللوحات مثل لوحه دولاب اجهزه طبيه واللي عليها رسم الادوات اللي كانو بيستخدموها في الطب قديما،وكمان بجانب المعبد حاجه روعه جدا وهي متحف التماسيح واللي كان بيضم عدد كبير من جميع انواع التماسيح المحنطه ومنها انواع انقرضت تماما',
                  Data_img: ''
                },

                {
                  text: ' ثم اتجهنا للمكان الاشهر في اسوان وهو(السد العالي ) وبحيره ناصر طبعا هو الاشهر في جنوب مصر ولكن كنت متحمس جدا اني ازوره طبعا كلنا عارفين ان السد العالي بيعود لعصر الرئيس جمال عبد الناصر لحماية مصر من الفيضانات ',
                  Data_img: require('./img/k7.jpg'),
                },
                {
                  text: 'وكمان يستخدم كمصدر للطاقه الكهربائيه مكنتش اتخيل ان حجمه ضخم جدا عكس ما بنشوف في التليفزيون طول السد٦_٣كم وعرضه ا كم تقريبا كان شكله مبهج كإنجاز مصري هندسي للتاريخ ومصدر للطاقه وبينقذ مصر كثيرا جدا من كوارث الفيضانات، وطبعا زي مازرنا السد العالي كان لازم نروح بحيره ناصر  واللي تعتبر نفس منطقه السد العالي',
                  Data_img: ''
                },
                {
                  text: 'ودي تعتبر اكبر بحيره صناعيه في العالم اجمع  ودي كانت بحيره تربط بين حدود مصر والسودان وسميت ناصر نسبه الى الرجل العظيم جمال عبد الناصر ،مساحه الحيره حوالي٥اميال وكانت بتستخمدم كمصدر هام جدا للثروه الزراعيه والسمكيه كمان ،انتهى النهار وانتهى يومنا هكذا وعدنا لمنزل ادهم ،وانا حزين ان غدا هو اخر ايام رحلتي لزهره الجنوب اسوان فعلا وصلنا المنزل وذهبت للنوم ',
                  Data_img: ''
                },
                {
                  text: "تم افتتاح متحف النيل في عام ٢٠٠٤ وبيشمل  رسم تخطيطي  لتاريخ السد العالي منذ إنشاؤه  وتخليد  الرئيس جمال عبد الناصر  ومتحف لاهم المشروعات  المصريه عبر التاريخ  بالاضافه الي مجموعه  كبيره من اللوحات  والآثار المصريه القديمه ' قضيت امتع رحلاتي علي الاطلاق  ودعت  ادهم  وانطلقت  علي خير في طريق عودتي  مره اخري الي بسيون  ........",
                  Data_img: ''
                },
              ]
            },


          ]

        },

      ],



    }
  }



  Hide_Splash_Screen = () => {
    this.setState({
      isVisible: false
    });
  }

  componentDidMount() {
    var that = this;
    setTimeout(function () {
      that.Hide_Splash_Screen();
    }, 5000);
  }

  render() {
    let Splash_Screen = (

      <View style={styles.SplashScreen_RootView}>
        <StatusBar
          hidden={true}
        />
        <View style={styles.SplashScreen_ChildView}>

          <Image source={require('./img/m1.jpg')}
            style={{ width: '100%', height: '100%', resizeMode: 'contain' }} />
        </View>
      </View>)

    return (
      <>
        <StatusBar
          backgroundColor='#0e918c'      // #0e918c
          barStyle='light-content'
        />
        <View style={{ flex: 1 }}>

          <View
            style={{
              width: '100%',
              height: '8%',
              justifyContent: 'space-between',
              alignItems: 'center',
              backgroundColor: '#0F9A92',
              flexDirection: 'row',
              paddingLeft: 10,
              paddingRight: 10
            }}>

            <Image source={require('./img/mmmmm3.jpg')}
              style={{
                width: '50%',
                height: '98%',
                resizeMode: 'contain',
                borderRadius: 10
              }}
            />

            <Image source={require('./img/mh18.png')}
              style={{
                width: '28%',
                height: '98%',
                //resizeMode:'contain',
                borderRadius: 10
              }}
            />

          </View>


          <ScrollView>

            <View
              style={{
                justifyContent: 'center',
                alignContent: 'center',
                marginTop: '1%',
                width: '100%',
                alignItems: 'center',

              }}>

              <Image source={require('./img/m5.jpg')}
                style={{
                  width: '95%',
                  height: windowHeight * .33,
                  maxWidth: windowHeight * .8,
                  maxHeight: windowHeight * 1,
                  resizeMode: 'stretch',
                  margin: 10,
                  borderRadius: 20,
                }}
              />
            </View>


            <View
              style={{
                justifyContent: 'space-between',
                alignItems: 'center',
                paddingLeft: 10,
                flexWrap: 'wrap',
                flexDirection: 'row',
                paddingRight: 10,
                marginTop: '6%'
              }}>

              {
                this.state.Categoris.map((data, index) =>

                  index == 2 ? (

                    <TouchableOpacity activeOpacity={.3}
                      onPress={() => {
                        this.props.navigation.navigate("Page2", {
                          Items: data.Items,
                          name: data.name,
                          index: index,
                        }
                        )
                      }}

                    >

                      <View
                        style={{
                          justifyContent: 'space-between',
                          alignItems: 'center',
                          backgroundColor: '#e1e1e1',
                          marginBottom: '20%',
                          borderRadius: 15,
                          width: windowWidth * .948,
                          height: 160,
                          padding: 10,
                          alignSelf: 'center',

                        }}>

                        <View style={{
                          flexDirection: 'row', justifyContent: 'space-between', paddingLeft: 10, width: windowWidth * .94,
                          height: 100, paddingRight: 10,
                        }}>
                          <Image source={require('./img/mahm1.png')}
                            style={{ width: 50, height: 50, }}
                          />

                          <Image source={data.photo}
                            style={{
                              width: 100,
                              height: 100,
                              //resizeMode:'contain',
                              borderRadius: 50
                            }}
                          />


                          <Image source={require('./img/mahm1.png')}
                            style={{ width: 50, height: 50, }}
                          />

                        </View>


                        <Text
                          style={{
                            fontSize: 20,
                            fontWeight: 'bold',
                            textAlign: 'center',
                            color: '#16697a'
                          }}>
                          {data.name}</Text>
                      </View>
                    </TouchableOpacity>


                  ) : (

                    <TouchableOpacity activeOpacity={.3}
                      onPress={() => {
                        this.props.navigation.navigate("Page2", {
                          Items: data.Items,
                          name: data.name,
                          index: index,
                        }
                        )
                      }}
                    >

                      <View
                        style={{
                          justifyContent: 'space-between',
                          alignItems: 'center',
                          backgroundColor: '#e1e1e1',
                          marginBottom: '20%',
                          borderRadius: 15,
                          width: windowWidth * .43,
                          height: 170,
                          padding: 10,

                        }}>

                        <Image source={data.photo}
                          style={{
                            width: 100,
                            height: 100,
                            //resizeMode:'contain',
                            borderRadius: 50
                          }}
                        />

                        <Text
                          style={{
                            fontSize: 20,
                            fontWeight: 'bold',
                            textAlign: 'center',
                            color: '#16697a'
                          }}>
                          {data.name}</Text>
                      </View>
                    </TouchableOpacity>
                  )

                )
              }
            </View>
          </ScrollView>



          {
            (this.state.isVisible === true) ? Splash_Screen : null
          }



        </View>



      </>
    )
  }

}
const styles = StyleSheet.create(
  {
    MainContainer:
    {
      flex: 1,
      justifyContent: 'center',
      alignItems: 'center',
      paddingTop: (Platform.OS === 'ios') ? 20 : 0
    },

    SplashScreen_RootView:
    {
      justifyContent: 'center',
      flex: 1,

      position: 'absolute',
      width: '100%',
      height: '100%',
    },

    SplashScreen_ChildView:
    {
      justifyContent: 'center',
      alignItems: 'center',
      backgroundColor: '#fff',
      flex: 1,
    },
  });

export default createAppContainer(
  createStackNavigator(
    {
      Page1: App,
      Page2: Screen1,
      Page3: Screen2,
    },
    { headerMode: 'none' },
    {
      initialRouteName: 'page1'
    }
  )
)